In [4]:
import seaborn as sb

In [5]:
import numpy as np
import pandas as pd

In [6]:
df = pd.DataFrame(np.arange(0,20).reshape(5,4), index=['Row1', 'Row2', 'Row3', 'Row4', 'Row5'], columns=['Col1', 'Col2', 'Col3', 'Col4'])

In [7]:
df.head()

      Col1  Col2  Col3  Col4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

In [8]:
#Accessing the Element
# 1. loc  2. iloc  loc--for Row Index
df.loc['Row1']

Col1    0
Col2    1
Col3    2
Col4    3
Name: Row1, dtype: int64

In [9]:
df.to_csv('Test1.csv')

In [10]:
type(df.loc['Row2'])

pandas.core.series.Series

In [11]:
df['Col1'].unique()

array([ 0,  4,  8, 12, 16])

In [12]:
df1=pd.read_csv('test.csv')

In [13]:
df1.head()

,ID,X0,X1,X2,X3,X4,X5,X6,X8,X10,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,1,az,v,n,f,d,t,a,w,0,...,0,0,0,1,0,0,0,0,0,0
1,2,t,b,ai,a,d,b,g,y,0,...,0,0,1,0,0,0,0,0,0,0
2,3,az,v,as,f,d,a,j,j,0,...,0,0,0,1,0,0,0,0,0,0
3,4,az,l,n,f,d,z,l,n,0,...,0,0,0,1,0,0,0,0,0,0
4,5,w,s,as,c,d,y,i,m,0,...,1,0,0,0,0,0,0,0,0,0

In [14]:
df.iloc[0:2,0:2]

      Col1  Col2
Row1     0     1
Row2     4     5

In [15]:
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [16]:
df.isnull().sum()

Col1    0
Col2    0
Col3    0
Col4    0
dtype: int64

In [17]:
df['Col1'].value_counts()

Col1
0     1
4     1
8     1
12    1
16    1
Name: count, dtype: int64

In [18]:
test_df = pd.read_csv('test1.csv', sep=';')

In [19]:
test_df.head()

  ,Col1,Col2,Col3,Col4
0         Row1,0,1,2,3
1         Row2,4,5,6,7
2       Row3,8,9,10,11
3     Row4,12,13,14,15
4     Row5,16,17,18,19

In [20]:
df1['X0'].value_counts()

X0
ak    432
y     348
z     335
x     302
ay    299
t     293
o     246
f     213
w     198
j     171
n     167
aj    162
az    161
s     116
ap    108
al     88
h      64
d      61
e      48
v      40
ai     38
af     34
m      34
am     28
i      25
at     21
u      20
ba     19
a      18
b      13
ad     12
k      12
aq     11
aw     11
r      10
ax      8
as      6
bc      6
l       6
c       6
ao      5
au      5
g       3
ag      1
av      1
an      1
ae      1
p       1
bb      1
Name: count, dtype: int64

In [21]:
from io import StringIO, BytesIO

In [45]:
data = ('col1, col2, col3\n'
       'x,y,1\n'
       'a,b,2\n'
       'c,d,3')

In [46]:
type(data)

str

In [47]:
StringIO()

In [55]:
pd.read_csv(StringIO(data))

  col1  col2   col3
0    x     y      1
1    a     b      2
2    c     d      3

In [54]:
## Read from specific columns data types
df = pd.read_csv(StringIO(data), usecols=['col1', 'col3'], skipinitialspace=True)

In [56]:
df

  col1  col3
0    x     1
1    a     2
2    c     3

In [57]:
df.to_csv('Test_Panda.csv')

In [60]:
data = ('a,b,c,d\n'
       '1,2,3,4\n'
       '5,6,7,8\n'
       '9,10,11,12\n'
       '13,14,15,16')
print(data)

a,b,c,d
1,2,3,4
5,6,7,8
9,10,11,12
13,14,15,16

In [73]:
df=pd.read_csv(StringIO(data), dtype={'b': int, 'c': float, 'a':'Int64'})

In [77]:
df

    a   b     c   d
0   1   2   3.0   4
1   5   6   7.0   8
2   9  10  11.0  12
3  13  14  15.0  16

In [78]:
type(df['a'][1])

numpy.int64

In [87]:
data = ('index,a,b,c\n'
       '4,apple,bat,5.6\n'
       '8,orange,dog,7')

In [88]:
pd.read_csv(StringIO(data), index_col=0)

            a    b    c
index
4       apple  bat  5.6
8      orange  dog  7.0

In [91]:
pd.read_csv(StringIO(data), usecols=['b', 'c'], index_col=False )

     b    c
0  bat  5.6
1  dog  7.0

In [94]:
#Escaping && Quoting --very useful in NLP
data = 'a,b\n"hello, \\"Bob\\", nice to see you",5'

In [95]:
pd.read_csv(StringIO(data), escapechar='\\')

                               a  b
0  hello, "Bob", nice to see you  5